export const tags = [
    {
        id: 1,
        title: 'Vue'
    },
    {
        id: 2,
        title: 'React'
    },
    {
        id: 3,
        title: 'Angular'
    },
    {
        id: 4,
        title: 'Vue'
    },
    {
        id: 5,
        title: 'React'
    },
    {
        id: 6,
        title: 'Angular'
    },
    {
        id: 7,
        title: 'Vue'
    },
    {
        id: 8,
        title: 'React'
    },
    {
        id: 9,
        title: 'Angular'
    },
]

export const list = [
    {
        id: 1,
        title: 'Vue',
        childrens: [
            {
                id: 1,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            },
            {
                id: 2,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            },
            {
                id: 3,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            },
            {
                id: 4,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            }
        ]
    },
    {
        id: 2,
        title: 'React',
        childrens: [
            {
                id: 1,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            },
            {
                id: 2,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            },
            {
                id: 3,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            },
            {
                id: 4,
                title: '浅谈前端中的二进制数据类型',
                add_timestamp: 1559838386395,
                tags: ['Vue', 'Js'],
                pv: 1542,
                content: '首先描述一下笔者遇到的问题，我们可以设定这样一个场景：现在有一个实时监控系统的开发需求，要求同时支持多个用户（这里我们为了简化，暂时不涉及登陆态，假定一个设备即为一个用户），对于不同的用户来讲，他们需要监控的一部分内容是完全相同的，比如设备的 CPU 信息、内存信息等，而另外一部分内容是部分用户重叠的，比如对某一区域的用户来说某些监控信息是相同的，而还有一些信息，则是用户之间完全不同的。对于每个用户来讲，当其进入页面之后即表明其开始监控，需要持续地进行数据更新，而当其退出界面或者手动点击停止监控，则停止监控。'
            }
        ]
    },
]